MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile uint16_t PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  uint16_t PTGWDT:3;
  uint16_t :1;
  uint16_t PTGPWD:4;
  uint16_t PTGDIV:5;
  uint16_t PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile uint16_t PTGBTE __attribute__((__sfr__));
__extension__ typedef struct tagPTGBTEBITS {
  union {
    struct {
      uint16_t OC1TSS:1;
      uint16_t OC2TSS:1;
      uint16_t OC3TSS:1;
      uint16_t OC4TSS:1;
      uint16_t OC1CS:1;
      uint16_t OC2CS:1;
      uint16_t OC3CS:1;
      uint16_t OC4CS:1;
      uint16_t IC1TSS:1;
      uint16_t IC2TSS:1;
      uint16_t IC3TSS:1;
      uint16_t IC4TSS:1;
      uint16_t ADCTS1:1;
      uint16_t ADCTS2:1;
      uint16_t ADCTS3:1;
      uint16_t ADCTS4:1;
    };
    struct {
      uint16_t PTGBTE:16;
    };
  };
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile uint16_t PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile uint16_t PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile uint16_t PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile uint16_t PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile uint16_t PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile uint16_t PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile uint16_t PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile uint16_t PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile uint16_t PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  uint16_t PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile uint16_t PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  uint16_t STEP0:8;
  uint16_t STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile uint16_t PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  uint16_t STEP2:8;
  uint16_t STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile uint16_t PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  uint16_t STEP4:8;
  uint16_t STEP5:8;
} PTGQUE2BITS;
extern volatile PTGQUE2BITS PTGQUE2bits __attribute__((__sfr__));

#define PTGQUE3 PTGQUE3
extern volatile uint16_t PTGQUE3 __attribute__((__sfr__));
typedef struct tagPTGQUE3BITS {
  uint16_t STEP6:8;
  uint16_t STEP7:8;
} PTGQUE3BITS;
extern volatile PTGQUE3BITS PTGQUE3bits __attribute__((__sfr__));

#define PTGQUE4 PTGQUE4
extern volatile uint16_t PTGQUE4 __attribute__((__sfr__));
typedef struct tagPTGQUE4BITS {
  uint16_t STEP8:8;
  uint16_t STEP9:8;
} PTGQUE4BITS;
extern volatile PTGQUE4BITS PTGQUE4bits __attribute__((__sfr__));

#define PTGQUE5 PTGQUE5
extern volatile uint16_t PTGQUE5 __attribute__((__sfr__));
typedef struct tagPTGQUE5BITS {
  uint16_t STEP10:8;
  uint16_t STEP11:8;
} PTGQUE5BITS;
extern volatile PTGQUE5BITS PTGQUE5bits __attribute__((__sfr__));

#define PTGQUE6 PTGQUE6
extern volatile uint16_t PTGQUE6 __attribute__((__sfr__));
typedef struct tagPTGQUE6BITS {
  uint16_t STEP12:8;
  uint16_t STEP13:8;
} PTGQUE6BITS;
extern volatile PTGQUE6BITS PTGQUE6bits __attribute__((__sfr__));

#define PTGQUE7 PTGQUE7
extern volatile uint16_t PTGQUE7 __attribute__((__sfr__));
typedef struct tagPTGQUE7BITS {
  uint16_t STEP14:8;
  uint16_t STEP15:8;
} PTGQUE7BITS;
extern volatile PTGQUE7BITS PTGQUE7bits __attribute__((__sfr__));

#define PTGQUE8 PTGQUE8
extern volatile uint16_t PTGQUE8 __attribute__((__sfr__));
typedef struct tagPTGQUE8BITS {
  uint16_t STEP16:8;
  uint16_t STEP17:8;
} PTGQUE8BITS;
extern volatile PTGQUE8BITS PTGQUE8bits __attribute__((__sfr__));

#define PTGQUE9 PTGQUE9
extern volatile uint16_t PTGQUE9 __attribute__((__sfr__));
typedef struct tagPTGQUE9BITS {
  uint16_t STEP18:8;
  uint16_t STEP19:8;
} PTGQUE9BITS;
extern volatile PTGQUE9BITS PTGQUE9bits __attribute__((__sfr__));

#define PTGQUE10 PTGQUE10
extern volatile uint16_t PTGQUE10 __attribute__((__sfr__));
typedef struct tagPTGQUE10BITS {
  uint16_t STEP20:8;
  uint16_t STEP21:8;
} PTGQUE10BITS;
extern volatile PTGQUE10BITS PTGQUE10bits __attribute__((__sfr__));

#define PTGQUE11 PTGQUE11
extern volatile uint16_t PTGQUE11 __attribute__((__sfr__));
typedef struct tagPTGQUE11BITS {
  uint16_t STEP22:8;
  uint16_t STEP23:8;
} PTGQUE11BITS;
extern volatile PTGQUE11BITS PTGQUE11bits __attribute__((__sfr__));

#define PTGQUE12 PTGQUE12
extern volatile uint16_t PTGQUE12 __attribute__((__sfr__));
typedef struct tagPTGQUE12BITS {
  uint16_t STEP24:8;
  uint16_t STEP25:8;
} PTGQUE12BITS;
extern volatile PTGQUE12BITS PTGQUE12bits __attribute__((__sfr__));

#define PTGQUE13 PTGQUE13
extern volatile uint16_t PTGQUE13 __attribute__((__sfr__));
typedef struct tagPTGQUE13BITS {
  uint16_t STEP26:8;
  uint16_t STEP27:8;
} PTGQUE13BITS;
extern volatile PTGQUE13BITS PTGQUE13bits __attribute__((__sfr__));

#define PTGQUE14 PTGQUE14
extern volatile uint16_t PTGQUE14 __attribute__((__sfr__));
typedef struct tagPTGQUE14BITS {
  uint16_t STEP28:8;
  uint16_t STEP29:8;
} PTGQUE14BITS;
extern volatile PTGQUE14BITS PTGQUE14bits __attribute__((__sfr__));

#define PTGQUE15 PTGQUE15
extern volatile uint16_t PTGQUE15 __attribute__((__sfr__));
typedef struct tagPTGQUE15BITS {
  uint16_t STEP30:8;
  uint16_t STEP31:8;
} PTGQUE15BITS;
extern volatile PTGQUE15BITS PTGQUE15bits __attribute__((__sfr__));

#define PTCON PTCON
extern volatile uint16_t PTCON __attribute__((__sfr__));
__extension__ typedef struct tagPTCONBITS {
  union {
    struct {
      uint16_t SEVTPS:4;
      uint16_t SYNCSRC:3;
      uint16_t SYNCEN:1;
      uint16_t SYNCOEN:1;
      uint16_t SYNCPOL:1;
      uint16_t EIPU:1;
      uint16_t SEIEN:1;
      uint16_t SESTAT:1;
      uint16_t PTSIDL:1;
      uint16_t :1;
      uint16_t PTEN:1;
    };
    struct {
      uint16_t SEVTPS0:1;
      uint16_t SEVTPS1:1;
      uint16_t SEVTPS2:1;
      uint16_t SEVTPS3:1;
      uint16_t SYNCSRC0:1;
      uint16_t SYNCSRC1:1;
      uint16_t SYNCSRC2:1;
    };
  };
} PTCONBITS;
extern volatile PTCONBITS PTCONbits __attribute__((__sfr__));

#define PTCON2 PTCON2
extern volatile uint16_t PTCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPTCON2BITS {
  union {
    struct {
      uint16_t PCLKDIV:3;
    };
    struct {
      uint16_t PCLKDIV0:1;
      uint16_t PCLKDIV1:1;
      uint16_t PCLKDIV2:1;
    };
  };
} PTCON2BITS;
extern volatile PTCON2BITS PTCON2bits __attribute__((__sfr__));

#define PTPER PTPER
extern volatile uint16_t PTPER __attribute__((__sfr__));
#define SEVTCMP SEVTCMP
extern volatile uint16_t SEVTCMP __attribute__((__sfr__));
typedef struct tagSEVTCMPBITS {
  uint16_t :3;
  uint16_t SEVTCMP:13;
} SEVTCMPBITS;
