MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
/* CLC4GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

/* CLC4GLSH */
/* Bitname _G3D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4T cannot be defined because it is used by more than one SFR */

/* PTGCST */
#define _PTGITM PTGCSTbits.PTGITM
#define _PTGWTO PTGCSTbits.PTGWTO
#define _PTGSTRT PTGCSTbits.PTGSTRT
#define _PTGIVIS PTGCSTbits.PTGIVIS
#define _PTGSSEN PTGCSTbits.PTGSSEN
#define _PTGSWT PTGCSTbits.PTGSWT
#define _PTGTOGL PTGCSTbits.PTGTOGL
#define _PTGSIDL PTGCSTbits.PTGSIDL
#define _PTGEN PTGCSTbits.PTGEN

/* PTGCON */
#define _PTGWDT PTGCONbits.PTGWDT
#define _PTGPWD PTGCONbits.PTGPWD
#define _PTGDIV PTGCONbits.PTGDIV
#define _PTGCLK PTGCONbits.PTGCLK

/* PTGBTE */
#define _OC1TSS PTGBTEbits.OC1TSS
#define _OC2TSS PTGBTEbits.OC2TSS
#define _OC3TSS PTGBTEbits.OC3TSS
#define _OC4TSS PTGBTEbits.OC4TSS
#define _OC1CS PTGBTEbits.OC1CS
#define _OC2CS PTGBTEbits.OC2CS
#define _OC3CS PTGBTEbits.OC3CS
#define _OC4CS PTGBTEbits.OC4CS
#define _IC1TSS PTGBTEbits.IC1TSS
#define _IC2TSS PTGBTEbits.IC2TSS
#define _IC3TSS PTGBTEbits.IC3TSS
#define _IC4TSS PTGBTEbits.IC4TSS
#define _ADCTS1 PTGBTEbits.ADCTS1
#define _ADCTS2 PTGBTEbits.ADCTS2
#define _ADCTS3 PTGBTEbits.ADCTS3
#define _ADCTS4 PTGBTEbits.ADCTS4
#define _PTGBTE PTGBTEbits.PTGBTE

/* PTGQPTR */
#define _PTGQPTR PTGQPTRbits.PTGQPTR

/* PTGQUE0 */
#define _STEP0 PTGQUE0bits.STEP0
#define _STEP1 PTGQUE0bits.STEP1

/* PTGQUE1 */
#define _STEP2 PTGQUE1bits.STEP2
#define _STEP3 PTGQUE1bits.STEP3

/* PTGQUE2 */
#define _STEP4 PTGQUE2bits.STEP4
#define _STEP5 PTGQUE2bits.STEP5

/* PTGQUE3 */
#define _STEP6 PTGQUE3bits.STEP6
#define _STEP7 PTGQUE3bits.STEP7

/* PTGQUE4 */
#define _STEP8 PTGQUE4bits.STEP8
#define _STEP9 PTGQUE4bits.STEP9

/* PTGQUE5 */
#define _STEP10 PTGQUE5bits.STEP10
#define _STEP11 PTGQUE5bits.STEP11

/* PTGQUE6 */
#define _STEP12 PTGQUE6bits.STEP12
#define _STEP13 PTGQUE6bits.STEP13

/* PTGQUE7 */
#define _STEP14 PTGQUE7bits.STEP14
#define _STEP15 PTGQUE7bits.STEP15

/* PTGQUE8 */
#define _STEP16 PTGQUE8bits.STEP16
#define _STEP17 PTGQUE8bits.STEP17

/* PTGQUE9 */
#define _STEP18 PTGQUE9bits.STEP18
#define _STEP19 PTGQUE9bits.STEP19

/* PTGQUE10 */
#define _STEP20 PTGQUE10bits.STEP20
#define _STEP21 PTGQUE10bits.STEP21

/* PTGQUE11 */
#define _STEP22 PTGQUE11bits.STEP22
#define _STEP23 PTGQUE11bits.STEP23

/* PTGQUE12 */
#define _STEP24 PTGQUE12bits.STEP24
#define _STEP25 PTGQUE12bits.STEP25

/* PTGQUE13 */
#define _STEP26 PTGQUE13bits.STEP26
#define _STEP27 PTGQUE13bits.STEP27

/* PTGQUE14 */
#define _STEP28 PTGQUE14bits.STEP28
#define _STEP29 PTGQUE14bits.STEP29

/* PTGQUE15 */
#define _STEP30 PTGQUE15bits.STEP30
#define _STEP31 PTGQUE15bits.STEP31

/* PTCON */
/* Bitname _SEVTPS cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _EIPU cannot be defined because it is used by more than one SFR */
/* Bitname _SEIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SESTAT cannot be defined because it is used by more than one SFR */
#define _PTSIDL PTCONbits.PTSIDL
#define _PTEN PTCONbits.PTEN
/* Bitname _SEVTPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC2 cannot be defined because it is used by more than one SFR */

/* PTCON2 */
/* Bitname _PCLKDIV cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV0 cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV1 cannot be defined because it is used by more than one SFR */
/* Bitname _PCLKDIV2 cannot be defined because it is used by more than one SFR */

/* SEVTCMP */
#define _SEVTCMP SEVTCMPbits.SEVTCMP

/* STCON */
/* Bitname _SEVTPS cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _EIPU cannot be defined because it is used by more than one SFR */
/* Bitname _SEIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SESTAT cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEVTPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSRC2 cannot be defined because it is used by more than one SFR */

