MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _I2C1STAT_ADD10_POSITION                 0x00000008
#define _I2C1STAT_ADD10_MASK                     0x00000100
#define _I2C1STAT_ADD10_LENGTH                   0x00000001

#define _I2C1STAT_GCSTAT_POSITION                0x00000009
#define _I2C1STAT_GCSTAT_MASK                    0x00000200
#define _I2C1STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C1STAT_BCL_POSITION                   0x0000000A
#define _I2C1STAT_BCL_MASK                       0x00000400
#define _I2C1STAT_BCL_LENGTH                     0x00000001

#define _I2C1STAT_ACKTIM_POSITION                0x0000000D
#define _I2C1STAT_ACKTIM_MASK                    0x00002000
#define _I2C1STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C1STAT_TRSTAT_POSITION                0x0000000E
#define _I2C1STAT_TRSTAT_MASK                    0x00004000
#define _I2C1STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C1STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C1STAT_ACKSTAT_MASK                   0x00008000
#define _I2C1STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C1ADD_ADD_POSITION                    0x00000000
#define _I2C1ADD_ADD_MASK                        0x000003FF
#define _I2C1ADD_ADD_LENGTH                      0x0000000A

#define _I2C1MSK_AMSK_POSITION                   0x00000000
#define _I2C1MSK_AMSK_MASK                       0x000003FF
#define _I2C1MSK_AMSK_LENGTH                     0x0000000A

#define _I2C1MSK_AMSK0_POSITION                  0x00000000
#define _I2C1MSK_AMSK0_MASK                      0x00000001
#define _I2C1MSK_AMSK0_LENGTH                    0x00000001

#define _I2C1MSK_AMSK1_POSITION                  0x00000001
#define _I2C1MSK_AMSK1_MASK                      0x00000002
#define _I2C1MSK_AMSK1_LENGTH                    0x00000001

#define _I2C1MSK_AMSK2_POSITION                  0x00000002
#define _I2C1MSK_AMSK2_MASK                      0x00000004
#define _I2C1MSK_AMSK2_LENGTH                    0x00000001

#define _I2C1MSK_AMSK3_POSITION                  0x00000003
#define _I2C1MSK_AMSK3_MASK                      0x00000008
#define _I2C1MSK_AMSK3_LENGTH                    0x00000001

#define _I2C1MSK_AMSK4_POSITION                  0x00000004
#define _I2C1MSK_AMSK4_MASK                      0x00000010
#define _I2C1MSK_AMSK4_LENGTH                    0x00000001

#define _I2C1MSK_AMSK5_POSITION                  0x00000005
#define _I2C1MSK_AMSK5_MASK                      0x00000020
#define _I2C1MSK_AMSK5_LENGTH                    0x00000001

#define _I2C1MSK_AMSK6_POSITION                  0x00000006
#define _I2C1MSK_AMSK6_MASK                      0x00000040
#define _I2C1MSK_AMSK6_LENGTH                    0x00000001

#define _I2C1MSK_AMSK7_POSITION                  0x00000007
#define _I2C1MSK_AMSK7_MASK                      0x00000080
#define _I2C1MSK_AMSK7_LENGTH                    0x00000001

#define _I2C1MSK_AMSK8_POSITION                  0x00000008
#define _I2C1MSK_AMSK8_MASK                      0x00000100
#define _I2C1MSK_AMSK8_LENGTH                    0x00000001

#define _I2C1MSK_AMSK9_POSITION                  0x00000009
#define _I2C1MSK_AMSK9_MASK                      0x00000200
#define _I2C1MSK_AMSK9_LENGTH                    0x00000001

#define _I2C1TRN_I2CTXDATA_POSITION              0x00000000
#define _I2C1TRN_I2CTXDATA_MASK                  0x000000FF
#define _I2C1TRN_I2CTXDATA_LENGTH                0x00000008

#define _I2C1RCV_I2CRXDATA_POSITION              0x00000000
#define _I2C1RCV_I2CRXDATA_MASK                  0x000000FF
#define _I2C1RCV_I2CRXDATA_LENGTH                0x00000008

#define _I2C2CON1_SEN_POSITION                   0x00000000
#define _I2C2CON1_SEN_MASK                       0x00000001
#define _I2C2CON1_SEN_LENGTH                     0x00000001

#define _I2C2CON1_RSEN_POSITION                  0x00000001
#define _I2C2CON1_RSEN_MASK                      0x00000002
#define _I2C2CON1_RSEN_LENGTH                    0x00000001

#define _I2C2CON1_PEN_POSITION                   0x00000002
#define _I2C2CON1_PEN_MASK                       0x00000004
#define _I2C2CON1_PEN_LENGTH                     0x00000001

#define _I2C2CON1_RCEN_POSITION                  0x00000003
#define _I2C2CON1_RCEN_MASK                      0x00000008
#define _I2C2CON1_RCEN_LENGTH                    0x00000001

#define _I2C2CON1_ACKEN_POSITION                 0x00000004
#define _I2C2CON1_ACKEN_MASK                     0x00000010
#define _I2C2CON1_ACKEN_LENGTH                   0x00000001

#define _I2C2CON1_ACKDT_POSITION                 0x00000005
#define _I2C2CON1_ACKDT_MASK                     0x00000020
#define _I2C2CON1_ACKDT_LENGTH                   0x00000001

#define _I2C2CON1_STREN_POSITION                 0x00000006
#define _I2C2CON1_STREN_MASK                     0x00000040
#define _I2C2CON1_STREN_LENGTH                   0x00000001

#define _I2C2CON1_GCEN_POSITION                  0x00000007
#define _I2C2CON1_GCEN_MASK                      0x00000080
#define _I2C2CON1_GCEN_LENGTH                    0x00000001

#define _I2C2CON1_SMEN_POSITION                  0x00000008
#define _I2C2CON1_SMEN_MASK                      0x00000100
#define _I2C2CON1_SMEN_LENGTH                    0x00000001

#define _I2C2CON1_DISSLW_POSITION                0x00000009
#define _I2C2CON1_DISSLW_MASK                    0x00000200
#define _I2C2CON1_DISSLW_LENGTH                  0x00000001

#define _I2C2CON1_A10M_POSITION                  0x0000000A
#define _I2C2CON1_A10M_MASK                      0x00000400
#define _I2C2CON1_A10M_LENGTH                    0x00000001

#define _I2C2CON1_STRICT_POSITION                0x0000000B
#define _I2C2CON1_STRICT_MASK                    0x00000800
#define _I2C2CON1_STRICT_LENGTH                  0x00000001

#define _I2C2CON1_SCLREL_POSITION                0x0000000C
#define _I2C2CON1_SCLREL_MASK                    0x00001000
#define _I2C2CON1_SCLREL_LENGTH                  0x00000001

#define _I2C2CON1_I2CSIDL_POSITION               0x0000000D
#define _I2C2CON1_I2CSIDL_MASK                   0x00002000
#define _I2C2CON1_I2CSIDL_LENGTH                 0x00000001

#define _I2C2CON1_I2CEN_POSITION                 0x0000000F
#define _I2C2CON1_I2CEN_MASK                     0x00008000
#define _I2C2CON1_I2CEN_LENGTH                   0x00000001

#define _I2C2CONL_SEN_POSITION                   0x00000000
#define _I2C2CONL_SEN_MASK                       0x00000001
#define _I2C2CONL_SEN_LENGTH                     0x00000001

#define _I2C2CONL_RSEN_POSITION                  0x00000001
#define _I2C2CONL_RSEN_MASK                      0x00000002
#define _I2C2CONL_RSEN_LENGTH                    0x00000001

#define _I2C2CONL_PEN_POSITION                   0x00000002
#define _I2C2CONL_PEN_MASK                       0x00000004
#define _I2C2CONL_PEN_LENGTH                     0x00000001

#define _I2C2CONL_RCEN_POSITION                  0x00000003
#define _I2C2CONL_RCEN_MASK                      0x00000008
#define _I2C2CONL_RCEN_LENGTH                    0x00000001

#define _I2C2CONL_ACKEN_POSITION                 0x00000004
#define _I2C2CONL_ACKEN_MASK                     0x00000010
#define _I2C2CONL_ACKEN_LENGTH                   0x00000001

#define _I2C2CONL_ACKDT_POSITION                 0x00000005
#define _I2C2CONL_ACKDT_MASK                     0x00000020
#define _I2C2CONL_ACKDT_LENGTH                   0x00000001

