MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _SPI2CON1H_AUDMOD0_POSITION              0x00000008
#define _SPI2CON1H_AUDMOD0_MASK                  0x00000100
#define _SPI2CON1H_AUDMOD0_LENGTH                0x00000001

#define _SPI2CON1H_AUDMOD1_POSITION              0x00000009
#define _SPI2CON1H_AUDMOD1_MASK                  0x00000200
#define _SPI2CON1H_AUDMOD1_LENGTH                0x00000001

#define _SPI2CON2_FRMCNT_POSITION                0x00000000
#define _SPI2CON2_FRMCNT_MASK                    0x00000007
#define _SPI2CON2_FRMCNT_LENGTH                  0x00000003

#define _SPI2CON2_FRMSYPW_POSITION               0x00000003
#define _SPI2CON2_FRMSYPW_MASK                   0x00000008
#define _SPI2CON2_FRMSYPW_LENGTH                 0x00000001

#define _SPI2CON2_MSSEN_POSITION                 0x00000004
#define _SPI2CON2_MSSEN_MASK                     0x00000010
#define _SPI2CON2_MSSEN_LENGTH                   0x00000001

#define _SPI2CON2_FRMPOL_POSITION                0x00000005
#define _SPI2CON2_FRMPOL_MASK                    0x00000020
#define _SPI2CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI2CON2_FRMSYNC_POSITION               0x00000006
#define _SPI2CON2_FRMSYNC_MASK                   0x00000040
#define _SPI2CON2_FRMSYNC_LENGTH                 0x00000001

#define _SPI2CON2_FRMEN_POSITION                 0x00000007
#define _SPI2CON2_FRMEN_MASK                     0x00000080
#define _SPI2CON2_FRMEN_LENGTH                   0x00000001

#define _SPI2CON2_AUDMOD_POSITION                0x00000008
#define _SPI2CON2_AUDMOD_MASK                    0x00000300
#define _SPI2CON2_AUDMOD_LENGTH                  0x00000002

#define _SPI2CON2_URDTEN_POSITION                0x0000000A
#define _SPI2CON2_URDTEN_MASK                    0x00000400
#define _SPI2CON2_URDTEN_LENGTH                  0x00000001

#define _SPI2CON2_AUDMONO_POSITION               0x0000000B
#define _SPI2CON2_AUDMONO_MASK                   0x00000800
#define _SPI2CON2_AUDMONO_LENGTH                 0x00000001

#define _SPI2CON2_IGNTUR_POSITION                0x0000000C
#define _SPI2CON2_IGNTUR_MASK                    0x00001000
#define _SPI2CON2_IGNTUR_LENGTH                  0x00000001

#define _SPI2CON2_IGNROV_POSITION                0x0000000D
#define _SPI2CON2_IGNROV_MASK                    0x00002000
#define _SPI2CON2_IGNROV_LENGTH                  0x00000001

#define _SPI2CON2_SPISGNEXT_POSITION             0x0000000E
#define _SPI2CON2_SPISGNEXT_MASK                 0x00004000
#define _SPI2CON2_SPISGNEXT_LENGTH               0x00000001

#define _SPI2CON2_AUDEN_POSITION                 0x0000000F
#define _SPI2CON2_AUDEN_MASK                     0x00008000
#define _SPI2CON2_AUDEN_LENGTH                   0x00000001

#define _SPI2CON2_FRMCNT0_POSITION               0x00000000
#define _SPI2CON2_FRMCNT0_MASK                   0x00000001
#define _SPI2CON2_FRMCNT0_LENGTH                 0x00000001

#define _SPI2CON2_FRMCNT1_POSITION               0x00000001
#define _SPI2CON2_FRMCNT1_MASK                   0x00000002
#define _SPI2CON2_FRMCNT1_LENGTH                 0x00000001

#define _SPI2CON2_FRMCNT2_POSITION               0x00000002
#define _SPI2CON2_FRMCNT2_MASK                   0x00000004
#define _SPI2CON2_FRMCNT2_LENGTH                 0x00000001

#define _SPI2CON2_AUDMOD0_POSITION               0x00000008
#define _SPI2CON2_AUDMOD0_MASK                   0x00000100
#define _SPI2CON2_AUDMOD0_LENGTH                 0x00000001

#define _SPI2CON2_AUDMOD1_POSITION               0x00000009
#define _SPI2CON2_AUDMOD1_MASK                   0x00000200
#define _SPI2CON2_AUDMOD1_LENGTH                 0x00000001

#define _SPI2CON2L_WLENGTH_POSITION              0x00000000
#define _SPI2CON2L_WLENGTH_MASK                  0x0000001F
#define _SPI2CON2L_WLENGTH_LENGTH                0x00000005

#define _SPI2CON3_WLENGTH_POSITION               0x00000000
#define _SPI2CON3_WLENGTH_MASK                   0x0000001F
#define _SPI2CON3_WLENGTH_LENGTH                 0x00000005

#define _SPI2STATL_SPIRBF_POSITION               0x00000000
#define _SPI2STATL_SPIRBF_MASK                   0x00000001
#define _SPI2STATL_SPIRBF_LENGTH                 0x00000001

#define _SPI2STATL_SPITBF_POSITION               0x00000001
#define _SPI2STATL_SPITBF_MASK                   0x00000002
#define _SPI2STATL_SPITBF_LENGTH                 0x00000001

#define _SPI2STATL_SPITBE_POSITION               0x00000003
#define _SPI2STATL_SPITBE_MASK                   0x00000008
#define _SPI2STATL_SPITBE_LENGTH                 0x00000001

#define _SPI2STATL_SPIRBE_POSITION               0x00000005
#define _SPI2STATL_SPIRBE_MASK                   0x00000020
#define _SPI2STATL_SPIRBE_LENGTH                 0x00000001

#define _SPI2STATL_SPIROV_POSITION               0x00000006
#define _SPI2STATL_SPIROV_MASK                   0x00000040
#define _SPI2STATL_SPIROV_LENGTH                 0x00000001

#define _SPI2STATL_SRMT_POSITION                 0x00000007
#define _SPI2STATL_SRMT_MASK                     0x00000080
#define _SPI2STATL_SRMT_LENGTH                   0x00000001

#define _SPI2STATL_SPITUR_POSITION               0x00000008
#define _SPI2STATL_SPITUR_MASK                   0x00000100
#define _SPI2STATL_SPITUR_LENGTH                 0x00000001

#define _SPI2STATL_SPIBUSY_POSITION              0x0000000B
#define _SPI2STATL_SPIBUSY_MASK                  0x00000800
#define _SPI2STATL_SPIBUSY_LENGTH                0x00000001

#define _SPI2STATL_FRMERR_POSITION               0x0000000C
#define _SPI2STATL_FRMERR_MASK                   0x00001000
#define _SPI2STATL_FRMERR_LENGTH                 0x00000001

#define _SPI2STATH_TXELM_POSITION                0x00000000
#define _SPI2STATH_TXELM_MASK                    0x0000003F
#define _SPI2STATH_TXELM_LENGTH                  0x00000006

#define _SPI2STATH_RXELM_POSITION                0x00000008
#define _SPI2STATH_RXELM_MASK                    0x00003F00
#define _SPI2STATH_RXELM_LENGTH                  0x00000006

#define _SPI2STATH_TXELM0_POSITION               0x00000000
#define _SPI2STATH_TXELM0_MASK                   0x00000001
#define _SPI2STATH_TXELM0_LENGTH                 0x00000001

#define _SPI2STATH_TXELM1_POSITION               0x00000001
#define _SPI2STATH_TXELM1_MASK                   0x00000002
#define _SPI2STATH_TXELM1_LENGTH                 0x00000001

