MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _SPI2IMSK2_TXMSK_POSITION                0x00000000
#define _SPI2IMSK2_TXMSK_MASK                    0x0000003F
#define _SPI2IMSK2_TXMSK_LENGTH                  0x00000006

#define _SPI2IMSK2_TXWIEN_POSITION               0x00000007
#define _SPI2IMSK2_TXWIEN_MASK                   0x00000080
#define _SPI2IMSK2_TXWIEN_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK_POSITION                0x00000008
#define _SPI2IMSK2_RXMSK_MASK                    0x00003F00
#define _SPI2IMSK2_RXMSK_LENGTH                  0x00000006

#define _SPI2IMSK2_RXWIEN_POSITION               0x0000000F
#define _SPI2IMSK2_RXWIEN_MASK                   0x00008000
#define _SPI2IMSK2_RXWIEN_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK0_POSITION               0x00000000
#define _SPI2IMSK2_TXMSK0_MASK                   0x00000001
#define _SPI2IMSK2_TXMSK0_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK1_POSITION               0x00000001
#define _SPI2IMSK2_TXMSK1_MASK                   0x00000002
#define _SPI2IMSK2_TXMSK1_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK2_POSITION               0x00000002
#define _SPI2IMSK2_TXMSK2_MASK                   0x00000004
#define _SPI2IMSK2_TXMSK2_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK3_POSITION               0x00000003
#define _SPI2IMSK2_TXMSK3_MASK                   0x00000008
#define _SPI2IMSK2_TXMSK3_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK4_POSITION               0x00000004
#define _SPI2IMSK2_TXMSK4_MASK                   0x00000010
#define _SPI2IMSK2_TXMSK4_LENGTH                 0x00000001

#define _SPI2IMSK2_TXMSK5_POSITION               0x00000005
#define _SPI2IMSK2_TXMSK5_MASK                   0x00000020
#define _SPI2IMSK2_TXMSK5_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK0_POSITION               0x00000008
#define _SPI2IMSK2_RXMSK0_MASK                   0x00000100
#define _SPI2IMSK2_RXMSK0_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK1_POSITION               0x00000009
#define _SPI2IMSK2_RXMSK1_MASK                   0x00000200
#define _SPI2IMSK2_RXMSK1_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK2_POSITION               0x0000000A
#define _SPI2IMSK2_RXMSK2_MASK                   0x00000400
#define _SPI2IMSK2_RXMSK2_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK3_POSITION               0x0000000B
#define _SPI2IMSK2_RXMSK3_MASK                   0x00000800
#define _SPI2IMSK2_RXMSK3_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK4_POSITION               0x0000000C
#define _SPI2IMSK2_RXMSK4_MASK                   0x00001000
#define _SPI2IMSK2_RXMSK4_LENGTH                 0x00000001

#define _SPI2IMSK2_RXMSK5_POSITION               0x0000000D
#define _SPI2IMSK2_RXMSK5_MASK                   0x00002000
#define _SPI2IMSK2_RXMSK5_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK_POSITION                0x00000000
#define _SPI2IMSKH_TXMSK_MASK                    0x0000003F
#define _SPI2IMSKH_TXMSK_LENGTH                  0x00000006

#define _SPI2IMSKH_TXWIEN_POSITION               0x00000007
#define _SPI2IMSKH_TXWIEN_MASK                   0x00000080
#define _SPI2IMSKH_TXWIEN_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK_POSITION                0x00000008
#define _SPI2IMSKH_RXMSK_MASK                    0x00003F00
#define _SPI2IMSKH_RXMSK_LENGTH                  0x00000006

#define _SPI2IMSKH_RXWIEN_POSITION               0x0000000F
#define _SPI2IMSKH_RXWIEN_MASK                   0x00008000
#define _SPI2IMSKH_RXWIEN_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK0_POSITION               0x00000000
#define _SPI2IMSKH_TXMSK0_MASK                   0x00000001
#define _SPI2IMSKH_TXMSK0_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK1_POSITION               0x00000001
#define _SPI2IMSKH_TXMSK1_MASK                   0x00000002
#define _SPI2IMSKH_TXMSK1_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK2_POSITION               0x00000002
#define _SPI2IMSKH_TXMSK2_MASK                   0x00000004
#define _SPI2IMSKH_TXMSK2_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK3_POSITION               0x00000003
#define _SPI2IMSKH_TXMSK3_MASK                   0x00000008
#define _SPI2IMSKH_TXMSK3_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK4_POSITION               0x00000004
#define _SPI2IMSKH_TXMSK4_MASK                   0x00000010
#define _SPI2IMSKH_TXMSK4_LENGTH                 0x00000001

#define _SPI2IMSKH_TXMSK5_POSITION               0x00000005
#define _SPI2IMSKH_TXMSK5_MASK                   0x00000020
#define _SPI2IMSKH_TXMSK5_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK0_POSITION               0x00000008
#define _SPI2IMSKH_RXMSK0_MASK                   0x00000100
#define _SPI2IMSKH_RXMSK0_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK1_POSITION               0x00000009
#define _SPI2IMSKH_RXMSK1_MASK                   0x00000200
#define _SPI2IMSKH_RXMSK1_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK2_POSITION               0x0000000A
#define _SPI2IMSKH_RXMSK2_MASK                   0x00000400
#define _SPI2IMSKH_RXMSK2_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK3_POSITION               0x0000000B
#define _SPI2IMSKH_RXMSK3_MASK                   0x00000800
#define _SPI2IMSKH_RXMSK3_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK4_POSITION               0x0000000C
#define _SPI2IMSKH_RXMSK4_MASK                   0x00001000
#define _SPI2IMSKH_RXMSK4_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK5_POSITION               0x0000000D
#define _SPI2IMSKH_RXMSK5_MASK                   0x00002000
#define _SPI2IMSKH_RXMSK5_LENGTH                 0x00000001

#define _SPI2URDTL_SPI2URDTL_POSITION            0x00000000
#define _SPI2URDTL_SPI2URDTL_MASK                0x0000FFFF
#define _SPI2URDTL_SPI2URDTL_LENGTH              0x00000010

#define _SPI2URDTL_URDATA_POSITION               0x00000000
#define _SPI2URDTL_URDATA_MASK                   0x0000FFFF
#define _SPI2URDTL_URDATA_LENGTH                 0x00000010

#define _SPI2URDTH_SPI2URDTH_POSITION            0x00000000
#define _SPI2URDTH_SPI2URDTH_MASK                0x0000FFFF
#define _SPI2URDTH_SPI2URDTH_LENGTH              0x00000010

#define _SPI2URDTH_URDATA_POSITION               0x00000000
#define _SPI2URDTH_URDATA_MASK                   0x0000FFFF
#define _SPI2URDTH_URDATA_LENGTH                 0x00000010

#define _ADCON1L_NRE_POSITION                    0x00000007
#define _ADCON1L_NRE_MASK                        0x00000080
#define _ADCON1L_NRE_LENGTH                      0x00000001

#define _ADCON1L_ADSIDL_POSITION                 0x0000000D
#define _ADCON1L_ADSIDL_MASK                     0x00002000
#define _ADCON1L_ADSIDL_LENGTH                   0x00000001

#define _ADCON1L_ADON_POSITION                   0x0000000F
#define _ADCON1L_ADON_MASK                       0x00008000
#define _ADCON1L_ADON_LENGTH                     0x00000001

#define _ADCON1H_SHRRES_POSITION                 0x00000005
#define _ADCON1H_SHRRES_MASK                     0x00000060
#define _ADCON1H_SHRRES_LENGTH                   0x00000002

#define _ADCON1H_FORM_POSITION                   0x00000007
#define _ADCON1H_FORM_MASK                       0x00000080
#define _ADCON1H_FORM_LENGTH                     0x00000001

