MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _ADMOD1L_SIGN20_POSITION                 0x00000008
#define _ADMOD1L_SIGN20_MASK                     0x00000100
#define _ADMOD1L_SIGN20_LENGTH                   0x00000001

#define _ADMOD1L_DIFF20_POSITION                 0x00000009
#define _ADMOD1L_DIFF20_MASK                     0x00000200
#define _ADMOD1L_DIFF20_LENGTH                   0x00000001

#define _ADMOD1L_SIGN21_POSITION                 0x0000000A
#define _ADMOD1L_SIGN21_MASK                     0x00000400
#define _ADMOD1L_SIGN21_LENGTH                   0x00000001

#define _ADMOD1L_DIFF21_POSITION                 0x0000000B
#define _ADMOD1L_DIFF21_MASK                     0x00000800
#define _ADMOD1L_DIFF21_LENGTH                   0x00000001

#define _ADIEL_IE0_POSITION                      0x00000000
#define _ADIEL_IE0_MASK                          0x00000001
#define _ADIEL_IE0_LENGTH                        0x00000001

#define _ADIEL_IE1_POSITION                      0x00000001
#define _ADIEL_IE1_MASK                          0x00000002
#define _ADIEL_IE1_LENGTH                        0x00000001

#define _ADIEL_IE2_POSITION                      0x00000002
#define _ADIEL_IE2_MASK                          0x00000004
#define _ADIEL_IE2_LENGTH                        0x00000001

#define _ADIEL_IE3_POSITION                      0x00000003
#define _ADIEL_IE3_MASK                          0x00000008
#define _ADIEL_IE3_LENGTH                        0x00000001

#define _ADIEL_IE4_POSITION                      0x00000004
#define _ADIEL_IE4_MASK                          0x00000010
#define _ADIEL_IE4_LENGTH                        0x00000001

#define _ADIEL_IE6_POSITION                      0x00000006
#define _ADIEL_IE6_MASK                          0x00000040
#define _ADIEL_IE6_LENGTH                        0x00000001

#define _ADIEL_IE7_POSITION                      0x00000007
#define _ADIEL_IE7_MASK                          0x00000080
#define _ADIEL_IE7_LENGTH                        0x00000001

#define _ADIEL_IE8_POSITION                      0x00000008
#define _ADIEL_IE8_MASK                          0x00000100
#define _ADIEL_IE8_LENGTH                        0x00000001

#define _ADIEL_IE9_POSITION                      0x00000009
#define _ADIEL_IE9_MASK                          0x00000200
#define _ADIEL_IE9_LENGTH                        0x00000001

#define _ADIEL_IE10_POSITION                     0x0000000A
#define _ADIEL_IE10_MASK                         0x00000400
#define _ADIEL_IE10_LENGTH                       0x00000001

#define _ADIEL_IE11_POSITION                     0x0000000B
#define _ADIEL_IE11_MASK                         0x00000800
#define _ADIEL_IE11_LENGTH                       0x00000001

#define _ADIEL_IE14_POSITION                     0x0000000E
#define _ADIEL_IE14_MASK                         0x00004000
#define _ADIEL_IE14_LENGTH                       0x00000001

#define _ADIEH_IE17_POSITION                     0x00000001
#define _ADIEH_IE17_MASK                         0x00000002
#define _ADIEH_IE17_LENGTH                       0x00000001

#define _ADIEH_IE18_POSITION                     0x00000002
#define _ADIEH_IE18_MASK                         0x00000004
#define _ADIEH_IE18_LENGTH                       0x00000001

#define _ADIEH_IE19_POSITION                     0x00000003
#define _ADIEH_IE19_MASK                         0x00000008
#define _ADIEH_IE19_LENGTH                       0x00000001

#define _ADIEH_IE20_POSITION                     0x00000004
#define _ADIEH_IE20_MASK                         0x00000010
#define _ADIEH_IE20_LENGTH                       0x00000001

#define _ADIEH_IE21_POSITION                     0x00000005
#define _ADIEH_IE21_MASK                         0x00000020
#define _ADIEH_IE21_LENGTH                       0x00000001

#define _ADCSSL_CSS0_POSITION                    0x00000000
#define _ADCSSL_CSS0_MASK                        0x00000001
#define _ADCSSL_CSS0_LENGTH                      0x00000001

#define _ADCSSL_CSS1_POSITION                    0x00000001
#define _ADCSSL_CSS1_MASK                        0x00000002
#define _ADCSSL_CSS1_LENGTH                      0x00000001

#define _ADCSSL_CSS2_POSITION                    0x00000002
#define _ADCSSL_CSS2_MASK                        0x00000004
#define _ADCSSL_CSS2_LENGTH                      0x00000001

#define _ADCSSL_CSS3_POSITION                    0x00000003
#define _ADCSSL_CSS3_MASK                        0x00000008
#define _ADCSSL_CSS3_LENGTH                      0x00000001

#define _ADCSSL_CSS4_POSITION                    0x00000004
#define _ADCSSL_CSS4_MASK                        0x00000010
#define _ADCSSL_CSS4_LENGTH                      0x00000001

#define _ADCSSL_CSS6_POSITION                    0x00000006
#define _ADCSSL_CSS6_MASK                        0x00000040
#define _ADCSSL_CSS6_LENGTH                      0x00000001

#define _ADCSSL_CSS7_POSITION                    0x00000007
#define _ADCSSL_CSS7_MASK                        0x00000080
#define _ADCSSL_CSS7_LENGTH                      0x00000001

#define _ADCSSL_CSS8_POSITION                    0x00000008
#define _ADCSSL_CSS8_MASK                        0x00000100
#define _ADCSSL_CSS8_LENGTH                      0x00000001

#define _ADCSSL_CSS9_POSITION                    0x00000009
#define _ADCSSL_CSS9_MASK                        0x00000200
#define _ADCSSL_CSS9_LENGTH                      0x00000001

#define _ADCSSL_CSS10_POSITION                   0x0000000A
#define _ADCSSL_CSS10_MASK                       0x00000400
#define _ADCSSL_CSS10_LENGTH                     0x00000001

#define _ADCSSL_CSS11_POSITION                   0x0000000B
#define _ADCSSL_CSS11_MASK                       0x00000800
#define _ADCSSL_CSS11_LENGTH                     0x00000001

#define _ADCSSL_CSS14_POSITION                   0x0000000E
#define _ADCSSL_CSS14_MASK                       0x00004000
#define _ADCSSL_CSS14_LENGTH                     0x00000001

#define _ADCSSH_CSS17_POSITION                   0x00000001
#define _ADCSSH_CSS17_MASK                       0x00000002
#define _ADCSSH_CSS17_LENGTH                     0x00000001

