MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _RPOR26_RP181R_POSITION                  0x00000008
#define _RPOR26_RP181R_MASK                      0x00007F00
#define _RPOR26_RP181R_LENGTH                    0x00000007

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x0000FF00
#define _RPINR2_T1CKR_LENGTH                     0x00000008

#define _RPINR3_T2CKR_POSITION                   0x00000000
#define _RPINR3_T2CKR_MASK                       0x000000FF
#define _RPINR3_T2CKR_LENGTH                     0x00000008

#define _RPINR3_T3CKR_POSITION                   0x00000008
#define _RPINR3_T3CKR_MASK                       0x0000FF00
#define _RPINR3_T3CKR_LENGTH                     0x00000008

#define _RPINR7_IC1R_POSITION                    0x00000000
#define _RPINR7_IC1R_MASK                        0x000000FF
#define _RPINR7_IC1R_LENGTH                      0x00000008

#define _RPINR7_IC2R_POSITION                    0x00000008
#define _RPINR7_IC2R_MASK                        0x0000FF00
#define _RPINR7_IC2R_LENGTH                      0x00000008

#define _RPINR8_IC3R_POSITION                    0x00000000
#define _RPINR8_IC3R_MASK                        0x000000FF
#define _RPINR8_IC3R_LENGTH                      0x00000008

#define _RPINR8_IC4R_POSITION                    0x00000008
#define _RPINR8_IC4R_MASK                        0x0000FF00
#define _RPINR8_IC4R_LENGTH                      0x00000008

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x000000FF
#define _RPINR11_OCFAR_LENGTH                    0x00000008

#define _RPINR12_FLT1R_POSITION                  0x00000000
#define _RPINR12_FLT1R_MASK                      0x000000FF
#define _RPINR12_FLT1R_LENGTH                    0x00000008

#define _RPINR12_FLT2R_POSITION                  0x00000008
#define _RPINR12_FLT2R_MASK                      0x0000FF00
#define _RPINR12_FLT2R_LENGTH                    0x00000008

#define _RPINR13_FLT3R_POSITION                  0x00000000
#define _RPINR13_FLT3R_MASK                      0x000000FF
#define _RPINR13_FLT3R_LENGTH                    0x00000008

#define _RPINR13_FLT4R_POSITION                  0x00000008
#define _RPINR13_FLT4R_MASK                      0x0000FF00
#define _RPINR13_FLT4R_LENGTH                    0x00000008

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x000000FF
#define _RPINR18_U1RXR_LENGTH                    0x00000008

#define _RPINR18_U1CTSR_POSITION                 0x00000008
#define _RPINR18_U1CTSR_MASK                     0x0000FF00
#define _RPINR18_U1CTSR_LENGTH                   0x00000008

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x000000FF
#define _RPINR19_U2RXR_LENGTH                    0x00000008

#define _RPINR19_U2CTSR_POSITION                 0x00000008
#define _RPINR19_U2CTSR_MASK                     0x0000FF00
#define _RPINR19_U2CTSR_LENGTH                   0x00000008

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x000000FF
#define _RPINR20_SDI1R_LENGTH                    0x00000008

#define _RPINR20_SCK1INR_POSITION                0x00000008
#define _RPINR20_SCK1INR_MASK                    0x0000FF00
#define _RPINR20_SCK1INR_LENGTH                  0x00000008

#define _RPINR21_SS1INR_POSITION                 0x00000000
#define _RPINR21_SS1INR_MASK                     0x000000FF
#define _RPINR21_SS1INR_LENGTH                   0x00000008

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x000000FF
#define _RPINR22_SDI2R_LENGTH                    0x00000008

#define _RPINR22_SCK2INR_POSITION                0x00000008
#define _RPINR22_SCK2INR_MASK                    0x0000FF00
#define _RPINR22_SCK2INR_LENGTH                  0x00000008

#define _RPINR23_SS2INR_POSITION                 0x00000000
#define _RPINR23_SS2INR_MASK                     0x000000FF
#define _RPINR23_SS2INR_LENGTH                   0x00000008

#define _RPINR26_C1RXR_POSITION                  0x00000000
#define _RPINR26_C1RXR_MASK                      0x000000FF
#define _RPINR26_C1RXR_LENGTH                    0x00000008

#define _RPINR26_C2RXR_POSITION                  0x00000008
#define _RPINR26_C2RXR_MASK                      0x0000FF00
#define _RPINR26_C2RXR_LENGTH                    0x00000008

#define _RPINR29_SDI3R_POSITION                  0x00000000
#define _RPINR29_SDI3R_MASK                      0x000000FF
#define _RPINR29_SDI3R_LENGTH                    0x00000008

#define _RPINR29_SCK3INR_POSITION                0x00000008
#define _RPINR29_SCK3INR_MASK                    0x0000FF00
#define _RPINR29_SCK3INR_LENGTH                  0x00000008

#define _RPINR30_SS3INR_POSITION                 0x00000000
#define _RPINR30_SS3INR_MASK                     0x000000FF
#define _RPINR30_SS3INR_LENGTH                   0x00000008

#define _RPINR37_PSYNCI1R_POSITION               0x00000008
#define _RPINR37_PSYNCI1R_MASK                   0x0000FF00
#define _RPINR37_PSYNCI1R_LENGTH                 0x00000008

#define _RPINR38_PSYNCI2R_POSITION               0x00000000
#define _RPINR38_PSYNCI2R_MASK                   0x000000FF
#define _RPINR38_PSYNCI2R_LENGTH                 0x00000008

#define _RPINR42_FLT5R_POSITION                  0x00000000
#define _RPINR42_FLT5R_MASK                      0x000000FF
#define _RPINR42_FLT5R_LENGTH                    0x00000008

#define _RPINR42_FLT6R_POSITION                  0x00000008
#define _RPINR42_FLT6R_MASK                      0x0000FF00
#define _RPINR42_FLT6R_LENGTH                    0x00000008

