MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS704/mcu.h
#define _PTGQUE5_STEP10_POSITION                 0x00000000
#define _PTGQUE5_STEP10_MASK                     0x000000FF
#define _PTGQUE5_STEP10_LENGTH                   0x00000008

#define _PTGQUE5_STEP11_POSITION                 0x00000008
#define _PTGQUE5_STEP11_MASK                     0x0000FF00
#define _PTGQUE5_STEP11_LENGTH                   0x00000008

#define _PTGQUE6_STEP12_POSITION                 0x00000000
#define _PTGQUE6_STEP12_MASK                     0x000000FF
#define _PTGQUE6_STEP12_LENGTH                   0x00000008

#define _PTGQUE6_STEP13_POSITION                 0x00000008
#define _PTGQUE6_STEP13_MASK                     0x0000FF00
#define _PTGQUE6_STEP13_LENGTH                   0x00000008

#define _PTGQUE7_STEP14_POSITION                 0x00000000
#define _PTGQUE7_STEP14_MASK                     0x000000FF
#define _PTGQUE7_STEP14_LENGTH                   0x00000008

#define _PTGQUE7_STEP15_POSITION                 0x00000008
#define _PTGQUE7_STEP15_MASK                     0x0000FF00
#define _PTGQUE7_STEP15_LENGTH                   0x00000008

#define _PTGQUE8_STEP16_POSITION                 0x00000000
#define _PTGQUE8_STEP16_MASK                     0x000000FF
#define _PTGQUE8_STEP16_LENGTH                   0x00000008

#define _PTGQUE8_STEP17_POSITION                 0x00000008
#define _PTGQUE8_STEP17_MASK                     0x0000FF00
#define _PTGQUE8_STEP17_LENGTH                   0x00000008

#define _PTGQUE9_STEP18_POSITION                 0x00000000
#define _PTGQUE9_STEP18_MASK                     0x000000FF
#define _PTGQUE9_STEP18_LENGTH                   0x00000008

#define _PTGQUE9_STEP19_POSITION                 0x00000008
#define _PTGQUE9_STEP19_MASK                     0x0000FF00
#define _PTGQUE9_STEP19_LENGTH                   0x00000008

#define _PTGQUE10_STEP20_POSITION                0x00000000
#define _PTGQUE10_STEP20_MASK                    0x000000FF
#define _PTGQUE10_STEP20_LENGTH                  0x00000008

#define _PTGQUE10_STEP21_POSITION                0x00000008
#define _PTGQUE10_STEP21_MASK                    0x0000FF00
#define _PTGQUE10_STEP21_LENGTH                  0x00000008

#define _PTGQUE11_STEP22_POSITION                0x00000000
#define _PTGQUE11_STEP22_MASK                    0x000000FF
#define _PTGQUE11_STEP22_LENGTH                  0x00000008

#define _PTGQUE11_STEP23_POSITION                0x00000008
#define _PTGQUE11_STEP23_MASK                    0x0000FF00
#define _PTGQUE11_STEP23_LENGTH                  0x00000008

#define _PTGQUE12_STEP24_POSITION                0x00000000
#define _PTGQUE12_STEP24_MASK                    0x000000FF
#define _PTGQUE12_STEP24_LENGTH                  0x00000008

#define _PTGQUE12_STEP25_POSITION                0x00000008
#define _PTGQUE12_STEP25_MASK                    0x0000FF00
#define _PTGQUE12_STEP25_LENGTH                  0x00000008

#define _PTGQUE13_STEP26_POSITION                0x00000000
#define _PTGQUE13_STEP26_MASK                    0x000000FF
#define _PTGQUE13_STEP26_LENGTH                  0x00000008

#define _PTGQUE13_STEP27_POSITION                0x00000008
#define _PTGQUE13_STEP27_MASK                    0x0000FF00
#define _PTGQUE13_STEP27_LENGTH                  0x00000008

#define _PTGQUE14_STEP28_POSITION                0x00000000
#define _PTGQUE14_STEP28_MASK                    0x000000FF
#define _PTGQUE14_STEP28_LENGTH                  0x00000008

#define _PTGQUE14_STEP29_POSITION                0x00000008
#define _PTGQUE14_STEP29_MASK                    0x0000FF00
#define _PTGQUE14_STEP29_LENGTH                  0x00000008

#define _PTGQUE15_STEP30_POSITION                0x00000000
#define _PTGQUE15_STEP30_MASK                    0x000000FF
#define _PTGQUE15_STEP30_LENGTH                  0x00000008

#define _PTGQUE15_STEP31_POSITION                0x00000008
#define _PTGQUE15_STEP31_MASK                    0x0000FF00
#define _PTGQUE15_STEP31_LENGTH                  0x00000008

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000070
#define _PTCON_SYNCSRC_LENGTH                    0x00000003

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_SEVTPS0_POSITION                  0x00000000
#define _PTCON_SEVTPS0_MASK                      0x00000001
#define _PTCON_SEVTPS0_LENGTH                    0x00000001

#define _PTCON_SEVTPS1_POSITION                  0x00000001
#define _PTCON_SEVTPS1_MASK                      0x00000002
#define _PTCON_SEVTPS1_LENGTH                    0x00000001

#define _PTCON_SEVTPS2_POSITION                  0x00000002
#define _PTCON_SEVTPS2_MASK                      0x00000004
#define _PTCON_SEVTPS2_LENGTH                    0x00000001

#define _PTCON_SEVTPS3_POSITION                  0x00000003
#define _PTCON_SEVTPS3_MASK                      0x00000008
#define _PTCON_SEVTPS3_LENGTH                    0x00000001

